Revit 2027 API
RebarPropagation.AlignByHost Method
 It will copy the source rebars, will align them in the same way as how the source host is aligned to destination host and will adapt them to the destinaion host.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ISet<ElementId> AlignByHost(
	Document doc,
	IList<Rebar> sourceRebars,
	Element destinationHost
)
Public Shared Function AlignByHost (
	doc As Document,
	sourceRebars As IList(Of Rebar),
	destinationHost As Element
) As ISet(Of ElementId)
public:
static ISet<ElementId^>^ AlignByHost(
	Document^ doc,
	IList<Rebar^>^ sourceRebars,
	Element^ destinationHost
)
static member AlignByHost :
        doc : Document *
        sourceRebars : IList<Rebar> *
        destinationHost : Element -> ISet<ElementId>
Parameters
doc Document
 A document.
sourceRebars IList<Rebar>
 The rebars that will be propagated. All of them must be from the same host.
destinationHost Element
 The destination host where the new rebar will be created.
Return Value
ISet<ElementId>
 The newly created rebars.
Exceptions
Exception | Condition
ArgumentException |  There are no source rebars to propagate. -or- The rebars should be from the same host. -or- The rebars that are group members can't be propagated. -or- destinationHost is not a valid rebar host. -or- The source and destination hosts should be of the same category. -or- The source and destination hosts must be different elements. -or- This method uses its own transaction, so it's not permitted to be invoked in an active transaction.
ArgumentNullException |  A non-optional argument was null
Remarks
The source and destination hosts should be of the same category.
The source and destination hosts should be different elements.
The destination host must be able to host rebar.
The source rebars should not be gourp members.
This method uses its own transaction, so it's not permitted to be invoked in an active transaction.
See Also
Reference
RebarPropagation Class
Autodesk.Revit.DB.Structure Namespace